micro/example_flow/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: makeFractureSTL.py                      |
|   \  /    A nd           | Time: 2026-06-10 11:09:10.354381                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(0.00000000 0.00000000 -0.00128235) // 0
	(0.04000000 0.00000000 -0.00128235) // 1
	(0.04000000 0.04000000 -0.00128235) // 2
	(0.00000000 0.04000000 -0.00128235) // 3
	(0.00000000 0.00000000 0.00108754) // 4
	(0.04000000 0.00000000 0.00108754) // 5
	(0.04000000 0.04000000 0.00108754) // 6
	(0.00000000 0.04000000 0.00108754) // 7
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 80 80 37 ) simpleGrading ( 1 1 1 ) // 0 
);

edges
(
);

boundary
(
);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
