micro/example_flow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    outletAverageVelocity
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);

        log             true;
        writeControl    timeStep;
        writeInterval   10;

        writeFields     false;
        surfaceFormat   none;

        regionType      patch;
        name            outlet;

        operation       areaNormalAverage;
        fields          (U);
    }

    outletFlowRate
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);

        writeControl    timeStep;
        writeInterval   10;

        writeFields     false;

        regionType      patch;
        name            outlet;

        operation       sum;
        fields          (phi);
    }

	outletMaxVelocity
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);

        log             true;
        writeControl    timeStep;
        writeInterval   10;

        writeFields     false;
        surfaceFormat   none;

        regionType      patch;
        name            outlet;

        operation       max;
        fields          (U);
    }
	stopOnUxResidual
    {
        type            runTimeControl;
        libs            ("libutilityFunctionObjects.so");

        conditions
        {
            UxConverged
            {
                type            equationInitialResidual;
                fields          (U.component(0));
                value           1e-6;
                mode            minimum;
            }
        }

        satisfiedAction end;
    }
}

// ************************************************************************* //
