micro/example_flow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


castellatedMesh true;
snap true;
addLayers false;
mergeTolerance 1e-06;
debug 0;

geometry
{
  fracture.stl
  {
    type triSurfaceMesh;
    regions
    {
      top { name upperWall; }
      bottom { name lowerWall; }
      left { name inlet; }
      right { name outlet; }
      front { name frontAndBack; }
      back { name frontAndBack; }
    }
  }
}


castellatedMeshControls {
  locationInMesh (0.02051282051282051 0.02051282051282051 -0.0004331073257387477);
  maxLocalCells 1000000;
  maxGlobalCells 1000000;
  minRefinementCells 0;

  nCellsBetweenLevels 2;
  resolveFeatureAngle 30;

  allowFreeStandingZoneFaces false;

  features ();
  refinementSurfaces
  {
    fracture.stl
    {
      level (0 0);
    }
  }
  refinementRegions {}
}

snapControls{
  nSmoothPatch 3;
  tolerance 4.0;

  nSolveIter 10;
  nRelaxIter 5;
  nFeatureSnapIter 3;

  implicitFeatureSnap true;
  explicitFeatureSnap false;
  multiRegionFeatureSnap false;
  }

addLayersControls{
  relativeSizes false;
  expansionRatio 1.2;
  finalLayerThickness 0.000001;
  minThickness 1e-7;

  layers
  {
    upperWall { nSurfaceLayers 3; }
    lowerWall { nSurfaceLayers 3; }
  }

  nGrow 0;
  featureAngle 130;
  maxFaceThicknessRatio 0.5;
  nSmoothSurfaceNormals 1;
  nSmoothThickness 10;
  minMedialAxisAngle 90;
  maxThicknessToMedialRatio 0.3;
  nSmoothNormals 3;
  slipFeatureAngle 30;
  nRelaxIter 5;
  nBufferCellsNoExtrude 0;
  nLayerIter 4;
  nRelaxedIter 4;
}

meshQualityControls {
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;


  minVol -1e30;
  minTetQuality 1e-13;

  maxConcave 80;

  minArea 0;
  minTwist -1;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;

  nSmoothScale 4;
  errorReduction 0.75;
  }